import React from "react";

const Project = () => {
  return (
    <div className="w-10/12 ">
      <h1 className="text-5xl text-center"> Английский для программиста.</h1>
      <p className="text-xl mt-4">
        Этот проект создан для начинающих web-разработчиков, как инструмент для
        изучения английского языка. На начальном этапе развития программиста ему
        не нужно говорить на английском, но ему гораздо облегчит жизнь
        способность на нем читать.
      </p>
      <p className="text-xl mt-4">
        Сколько слов нужно знать начинающему web-разработчику, чтобы читать
        документацию по языку или литературу по используемым технологиям?
      </p>
      <p className="text-xl mt-4">
        На разных ресурсах указываются разные цифры, на одном авторитетном
        сервисе для русскоязычных программистов я нашел цифру 3000-4000 слов, но
        на юТубКанале одного программиста из России, который работает в Европе я
        услышал очень оптимистичную цифру - 700 слов. И мне это количество слов
        кажется более правдоподобным. Важно понимать, что вам нужно знать 700
        специальных слов, часть из которых термины или слова из математики и
        т.д. Имеется в виду, что человеку, хорошо освоившему школьнцю программу
        по английскому плюсом нужно выучить 700 слов и он сможет очень сносно
        понимать, что написано в литературе по вашему языку программирования.
      </p>{" "}
      <p className="text-xl mt-4">
        Как выучить эти слова, а главное, как узнать, какие слова нужно учить?
        Могу вам предложить свою методику, она называется "берешь книгу и
        читаешь"! В процессе чтения пишешь перевод незнакомых слов прямо между
        строчек. Если вы читаете с экрана, тогда придется
      </p>
    </div>
  );
};

export default Project;
